schema/MailService.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.6 in JDK 6. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.6 in JDK 6. --><definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="urn:zimbraMail" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="urn:zimbraMail" name="MailService">
  <types>
    <xsd:schema>
      <xsd:import namespace="urn:zimbraMail" schemaLocation="zimbraMail.xsd"></xsd:import>
    </xsd:schema>
  </types>

  <message name="getDataSourcesRequest">
    <part name="parameters" element="tns:GetDataSourcesRequest"></part>
  </message>
  <message name="getDataSourcesResponse">
    <part name="parameters" element="tns:GetDataSourcesResponse"></part>
  </message>

  <message name="getFolderRequest">
    <part name="parameters" element="tns:GetFolderRequest"></part>
  </message>
  <message name="getFolderResponse">
    <part name="parameters" element="tns:GetFolderResponse"></part>
  </message>

  <portType name="MailService">
    <operation name="getDataSourcesRequest">
      <input message="tns:getDataSourcesRequest"/>
      <output message="tns:getDataSourcesResponse"/>
    </operation>
    <operation name="getFolderRequest">
      <input message="tns:getFolderRequest"/>
      <output message="tns:getFolderResponse"/>
    </operation>
  </portType>

  <binding name="MailServicePortBinding" type="tns:MailService">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"></soap:binding>
    <operation name="getDataSourcesRequest">
      <soap:operation soapAction=""></soap:operation>
      <input>
	<soap:body use="literal"></soap:body>
      </input>
      <output>
	<soap:body use="literal"></soap:body>
      </output>
    </operation>
    <operation name="getFolderRequest">
      <soap:operation soapAction=""></soap:operation>
      <input>
	<soap:body use="literal"></soap:body>
      </input>
      <output>
	<soap:body use="literal"></soap:body>
      </output>
    </operation>
  </binding>

  <service name="MailService">
    <port name="MailServicePort" binding="tns:MailServicePortBinding">
      <soap:address location="http://localhost:7070/service/soap"></soap:address>
    </port>
  </service>
</definitions>
